#Напишите программу, в которой пользователь будет задавать две строки, а программа -
#определять количество вхождений одной строки в другой.

first = input("Введите первую строку:")
second =input("Введите вторую строку:")
print (f"Количество вхождений второй строки в первую {first.count(second)}")